# 14 ЗАДАНИЕ. ШАБЛОНЫ 
+ ПРЕВЫШЕНИЕ ЛИМИТА КОНВЕРТАЦИИ (_Обход лимита._ Не рекомендуемо на слабом железе)
```py
import sys
sys.set_int_max_str_digits(10000)
```
+ ФУНКЦИЯ ДЛЯ ПЕРЕВОДА ЧИСЕЛ В СИСТЕМЫ СЧИСЛЕНИЯ (где n - искомое число, а q - система счисления) 
```py
def toq(n: int, q: int) -> str:
    s = ''
    while n > 0:
        s += str(n % q)
        n //= q
    return s[::-1]
```
### Примеры
1. Значение выражения 9²⁰⁰  + 3¹⁰⁰ – 7 записали в системе счисления с основанием 3. Сколько цифр «2» содержится в записи? 
```py
def toq(n: int, q: int) -> str:
    s = ''
    while n > 0:
        s += str(n % q)
        n //= q
    return s[::-1]

n = 9**200 + 3**100 - 7
print(toq(n, 3).count('2'))
```
2. Значение выражения 3 * 343⁸ + 5 * 49¹² + 7¹⁵ – 49 записали в системе счисления с основанием 7 без незначащих нулей. Какая цифра чаще всего встречается в этой записи? 
```py
from collections import Counter

n = 3*343**8 + 5*49**12 + 7**15 - 49

s = toq(n, 7)
# заполнение словаря количеством цифр в числе
n_dict = dict(Counter(s))

# print(n_dict)

# используем n_dict.get для сравнения по значениям, а не по ключам
print(max(n_dict, key=n_dict.get))
```
3. Значение арифметического выражения 3 · 289²⁰²⁴ + 81 · 49¹²¹ − 9 · 16⁸¹ − 6011 записали в системе счисления с основанием 31. Определите сумму цифр с числовым значением, не превышающим 17, в записи этого числа.
```py
def toq(n: int, q: int) -> str:
    # создаем алфавит всех возможных цифр, если q > 10
    al = '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ'
    s = ''
    
    while n > 0:
        s += al[n % q]
        n //= q
    return s[::-1]

n = 3*289**2024 + 81*49**121 - 9*16**81 - 6011
s = toq(n, 31)

# print(int(ns, 31) == n) - для проверки правильности перевода

# переводим каждую цифру в десятичную систему и сравниваем
d_sum = sum([int(d, 31) for d in s if int(d, 31) <= 17])
print(d_sum)
```
4. Операнды арифметического выражения записаны в системе счисления с основанием 17.
66x63₁₇ – 5x810₁₇
В записи чисел переменной x обозначена неизвестная цифра из алфавита 17-ричной системы счисления. Определите наименьшее значение x, при котором значение данного арифметического выражения кратно 11. Для найденного значения x вычислите частное от деления значения арифметического выражения на 11 и укажите его в ответе в десятичной системе счисления. Основание системы счисления в ответе указывать не нужно.
```py
al = '0123456789ABCDEFG'

for x in al:
    n = int(f'66{x}63', 17) - int(f'5{x}810', 17)
    if n % 11 == 0:
        print(x, n // 11)
        break
```
5. В системе счисления с основанием p выполняется равенство 32x8 + xxx9  =  yy02. Буквами x и y обозначены некоторые цифры из алфавита системы счисления с основанием p. Определите значение числа yyxp и запишите это значение в десятичной системе счисления.
```py
# определяем систему счисления с помощью столбика
a = '0123456789ABCDE'
p = 15

for x in a:
    for y in a:
        if (int(f"32{x}8", p) + int(f"{x*3}9", p)) == int(f"{y*2}02", p):
            # print(x, y, p)
            print(int(y*2 + x, p))
            break
```
6. Числа M и N записаны в системе счисления с основанием 14 соответственно.
M = 8x12x, N = 8x542
В записи чисел переменной x обозначена неизвестная цифра из алфавита четырнадцатеричной системы счисления. Определите наименьшее значение натурального числа A, при котором существует такой x, что M + A кратно N.
```py
al = "0123456789ABCD"

for a in range(1, 1000):
    for x in al:
        if (int(f"8{x}12{x}", 14) + a) % int(f"8{x}542", 14) == 0:
            print(a)
            exit()
```
7. Операнды арифметического выражения записаны в системах счисления с основаниями 9 и 12:
2y66x⁹ + x0y1¹²
В записи чисел переменными x и y обозначены допустимые в данных системах счисления неизвестные цифры. Определите значения x и y, при которых значение данного арифметического выражения будет наименьшим и кратно 170. Для найденных значений x и y вычислите частное от деления значения арифметического выражения на 170 и укажите его в ответе в десятичной системе счисления.
```py
# выбираем наименьшую систему счисления (из 9 и 12 -> 9)
res = []
al = '012345678'

for x in al:
    for y in al:
        n = int(f"2{y}66{x}", 9) + int(f"{x}0{y}1", 12)
        if n % 170 == 0:
            res.append(n)
if res:
    print(min(res) // 170)
```
8. Значение арифметического выражения 6²⁶⁰ + 6¹⁶⁰ + 6⁶⁰ – х, где х – целое положительное число, не превышающее 2030, записали в 6-ричной системе счисления. Определите наименьшее значение х, при котором количество нулей в 6-ричной записи числа, являющегося значением данного арифметического выражения, равно 202. В ответе запишите число в десятичной системе счисления.
```py
def toq(n: int, q: int) -> str:
    s = ''
    while n > 0:
        s += str(n % q)
        n //= q
    return s[::-1]

n = 6**260 + 6**160 + 6**60

for x in range(1, 2030 + 1):
    if toq(n-x, 6).count('0') == 202:
        print(x)
        break
```
9. Операнды арифметического выражения записаны в системах счисления с основаниями 21 (12yx921+36y9921)
В записи чисел переменными х и у обозначены неизвестные цифры из алфавита 21-ричной системы счисления. Определите наименьшее значение х, при которых значение данного арифметического выражения кратно 18 при любом значении у. Для найденного значения х вычислите частное от деления
значения арифметического выражения на 1810 при у=5 и укажите его в ответе в десятичной системе счисления.
```py
for x in '0123456789ABCDEFGHIJK':
    if all((int(f'12{y}{x}9', 21)+int(f'36{y}99', 21))%18==0 for y in '0123456789ABCDEFGHIJK'):
        print((int(f'12{5}{x}9', 21)+int(f'36{5}99', 21))/18)
        break
# смесь 15 и 14, можно через flag
```
