print(1, "idk", sep="\t")
print(2, "idk", sep="\t")
print(3, 23 + 11 + 75 + 31 + 1, sep="\t")
print(4, 28, sep="\t")
print(5, 20, sep="\t")
print(6, max(7, 22, 19), sep="\t")
print(7, 38, sep="\t")
print(8, 32 + 6 - 5 - 15, sep="\t")
print(9, 8 - 1, sep="\t")
print(10, 20 - 1, sep="\t")
# ЛУЧШЕ ПРОСМОТРЕТЬ ВСЕ ЗНАЧЕНИЯ, КОТОРЫЕ ОТНИМАЮТСЯ, И ОТДЕЛЬНЫЕ СЛУЧАИ И ТД И ТП, ВСЕ УЧЕСТЬ В ОБЩЕМ-ТО
# - заменяем на пустоту или проверяем все отдельные слова на наличие пустоты, а не дефиса!!!
print(11, 112 - 9, sep="\t")
print(12, 1, sep="\t")  # ПОСМОТРЕЛ ВСЕ СЛУЧАИ + ЛОГИКА!
print(13, 6, sep="\t")  # СЧИТАТЬ ВНИМАТЕЛЬНО НА ЛИСТКЕ С САМОГО НАЧАЛА!
# Просто тон - "ищем по префиксу" - "ищем по суффиксу" + "все слово" (тк два раза убирается от пр. и суф.) либо вручную
print(14, 65 - 19 - 16 + 2, sep="\t")
# Noqa ПРОДВИНУТЫЕ НАСТРОЙКИ -> специальные символы -> любая буква ^$ !!!! и вручную смотреть, можно заменить НАЙДЕННОЕ НА "GOT IT"!
# <....>  ДЛЯ ВЫДЕЛЕНИЯ ЦЕЛОГО СЛОВА, НО ЛУЧШЕ ВРУЧНУЮ, в .... - само слово
print(15, 13, sep="\t")
