from math import ceil, log2


print("#1", ceil(log2(128)) * 64 * 128 // 2 ** 13)
print("#2", 2**int(420 * 2 ** 13 / 768 / 600))
print("#3", int(12 / (600 / 300 * 2) / (24 / 8)))
print("#4", int(128 * 16 * 640 * 480 / 2 ** 23))
print("#5", ceil(1600 * 1200 * ceil(log2(1500)) / 2 ** 13))
print("#6", ceil(ceil(log2(1600)) * 480 * 640 / 2 ** 13))
print("#7", 2 ** int(6 * 2 ** 23 / 1536 / 2048))
print("#8", 2 ** int(13 * 2 ** 23 / 2160 / 3900))
print("#9", 2 ** int(90 / 0.65 * 2 ** 13 / 192 / 960))
print("#10", 2 ** int(170 * 1.35 * 2 ** 13 / 256 / 640))
print("#11", 2 ** (int(210 * 2 ** 13 / 1024 / 120) - 7))  # or just 7=7, 2**7
print("#12", 2 ** (int(405 * 2 ** 13 / 480 / 768) - 3))  # -3 тк для каждых 2 битов 1 бит просто так тратится на чет.
print("#13", 2 ** int(9 * 2 ** 23 / (60 / 10) / 1536 / 1024))
print("#14", int((48 * 2 ** 23 / (64 * 1000 * 16 * 2)) / 60))
print("#15", round(5625 * 2 ** 23 / (48 * 1000 * 24 * 2) / 60 / 5) * 5)  # ближайшее кратное к 5, вручную лучше смотр.
print("#16", 3 * 100 // (15 * 4))
print("#17", (2 * 48000 * 16 * 90) // 32000 // 60)
print("#18", ceil(5 * 60 * 40 * 1000 * 16 * 4 / 2 ** 23))  # все время /, а уже после смотреть на куда округлять
print("#19", int(82 * 2 ** 23 / (2 * 44 * 1000 * (5 * 60 + 25))))
print("#20", int(80 * 2 ** 23 / (2 * 80 * 1000 * (3 * 60 + 25))))
print("#21", int((1024 * 2 ** 13 / 2 ** 20) + 10 * 2 ** 23 / 2 ** 13))
print("#22", int(30 / 4 / 2 * 1.5))  # Только целое число, писать такие задачи на бумаге, думать логически
print("#23", int((4 * 2 ** 23 / 2 ** 24) + (4 * 2 ** 23 / 2 ** 20)))
A = 40 + (500 * 2 ** 23 // (100 * 2 ** 20)) * 2
B = 500 * 2 ** 23 // (10 * 2 ** 20)
print("#24", f"A{B - A}" if A < B else f"B{A - B}")  # Разницу в секундах между двумя способами* ЧИТАТЬ УСЛОВИЯ ДО КОНЦА
