from math import ceil, log2, floor


print("#1", (ceil(ceil(log2(8)) * 15 / 8) + 24) * 20)
print("#2", (ceil(ceil(log2(12)) * 7 / 8) + 15) * 150)
print("#3", 500 // 20 - ceil(ceil(log2(26 * 2 + 10 + 6)) * 9 / 8))  # ВНИМАТЕЛЬНОСТЬ!!!
print("#4", 1 * 2 ** 10 / (ceil(ceil(log2(26 * 2 + 10)) * 11 / 8) + 13))
print("#5", 28 - ceil(ceil(log2(120)) / 8) - ceil(ceil(log2(26 * 2 + 10)) * 11 / 8))  # ВАЖНО!!! КОД от 1 до 120 вместе
print("#6", 30 - ceil(ceil(log2(10 + 15)) * 11 / 8) - ceil((ceil(log2(26)) * 5 + ceil(log2(10)) * 3) / 8))
print("#7", 256 * ceil(86 * ceil(log2(250)) / 8))
print("#8", 6 * 2 ** 10 // 192 - ceil(20 * ceil(log2(2 + 7)) / 8) - 4)
print("#9", 2048 * ceil(101 * ceil(log2(10 + 4090)) / 8) // 2 ** 10)
print("#10", 276 * 2 ** 10 / 862, ceil(261 * ceil(log2(52 + 458 + 10)) / 8))  # ВСЕГДА В ТАКИХ ЗАДАЧАХ СРАВНЕНИЕМ!!!!
print("#11", 213 * 2 ** 10 / 708, ceil(274 * ceil(log2(10 + 26 + 450)) / 8))  # БЫЛО ОТВЕДЕНО БОЛЕЕ 213, НАЙТИ МИН!!!!
print("#12", 150 * 2 ** 10 / 1200, ceil(80 * 12 / 8), 2 ** 12)  # СНАЧАЛА УСЛОВИЕ, ПОТОМ ЛОГИКА, ЗАТЕМ ДЕЙСТВИЕ!!!
# noqa МИНИМАЛЬНАЯ МОЩНОСТЬ (КОЛИЧЕСТВО СИМВОЛОВ) БУДЕТ ЗА СЧЕТ 2 ** (МАКСИМАЛЬНО ВОЗМОЖНОЙ б. - 1) + 1; ЛУЧШЕ ПЕРЕБОРОМ ЦИКЛОМ ДЕЛАТЬ ТАКИЕ!!!
print("#13", 31 * 2 ** 20 / 252_500, ceil(261 * 4 / 8), 2 ** (4 - 1) + 1, ceil(log2(9)) == 4)
print("#14", 543 * 2 ** 10 / 4322 - ceil(99 * ceil(log2(10 + 510)) / 8), 5)  # БЕРЕМ БОЛЬШЕ, ТК БОЛЕЕ 543 КБ!!!!
# МАКС. ДП ПРИ НЕ БОЛЕЕ 311 КБ! ДОП СВЕДЕНИЯ ДЛЯ ВСЕХ ПОЛЬЗОВАТЕЛЕЙ!!!!
print("#15", int(311 * 2 ** 10 / 312 - ceil(745 * ceil(log2(10 + 999)) / 8)) * 312)
